app/views/recipe_types/show.html.erb

<div class="d-flex flex-wrap">
<% @recipe_type.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."recipe_type_id" = ?  [["recipe_type_id", 1]]