app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
    @recipe_types = RecipeType.all
---
SELECT "recipes".* FROM "recipes"
SELECT "recipe_types".* FROM "recipe_types"

  def new
    @recipe = Recipe.new
    @recipe_types = RecipeType.all
---
SELECT "recipe_types".* FROM "recipe_types"

  def create
    @recipe = current_user.recipes.new(recipe_params)
    # @recipe = Recipe.new(recipe_params)
    # @recipe.user = current_user
    if @recipe.save
---
INSERT INTO "recipes" ("title", "cuisine", "difficulty", "cook_time", "created_at", "updated_at", "cook_method", "ingredients", "recipe_type_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @recipe_types = RecipeType.all
---
SELECT "recipe_types".* FROM "recipe_types"

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "title" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Bolo de chocolate"], ["updated_at", "2019-09-25 18:50:21.011783"], ["id", 1]]

  def search
    @recipes = Recipe.where('title LIKE ?', "%#{params[:search]}%")
---
SELECT "recipes".* FROM "recipes" WHERE (title LIKE '%cenoura%')

  def set_recipe_type
    @recipe_types = RecipeType.all
---
SELECT "recipe_types".* FROM "recipe_types"