app/controllers/recipe_types_controller.rb

SELECT  "recipe_types".* FROM "recipe_types" WHERE "recipe_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @recipe_type = RecipeType.find(params[:id])

INSERT INTO "recipe_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sobremesa"], ["created_at", "2019-09-27 14:38:07.608366"], ["updated_at", "2019-09-27 14:38:07.608366"]]
---
  def create
    @recipe_type = RecipeType.new(params.require(:recipe_type).permit(:name))
    if @recipe_type.save()